IDENTIFICATION DIVISION.
PROGRAM-ID. ASSERTIONS.

DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 ASSERTION-ERRORS-COUNT PIC 999 VALUE 0.

  LINKAGE SECTION.
    01 EXPECTED-VALUE PIC X(30).
    01 ACTUAL-VALUE PIC X(30).


PROCEDURE DIVISION.

  ENTRY 'ASSERT-EQUALS' USING EXPECTED-VALUE, ACTUAL-VALUE.
    IF EXPECTED-VALUE = ACTUAL-VALUE THEN
      DISPLAY "." WITH NO ADVANCING
    ELSE
      ADD 1 TO ASSERTION-ERRORS-COUNT
      DISPLAY SPACES
      DISPLAY "Mismatch: >" EXPECTED-VALUE "<"
      DISPLAY "  actual: >" ACTUAL-VALUE "<"
    END-IF
  GOBACK.

  ENTRY 'CHECK-FOR-ERRORS'
    IF ASSERTION-ERRORS-COUNT > 0 THEN
      STOP RUN RETURNING 1
    END-IF.
  GOBACK.