IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-MESSAGE.

DATA DIVISION.
   LINKAGE SECTION.
   01 RETURNED-MESSAGE PIC A(30).
   01 USER-NAME.
      02 firstLetterOfName PIC A(1).
      02 FILLER PIC A(14).

PROCEDURE DIVISION USING RETURNED-MESSAGE, USER-NAME.
  MOVE SPACES TO RETURNED-MESSAGE.
  MOVE FUNCTION UPPER-CASE(firstLetterOfName) TO firstLetterOfName.
  IF USER-NAME = SPACES THEN
    MOVE 'world' to USER-NAME.
  STRING
    'Hello, ' DELIMITED BY SIZE
    USER-NAME DELIMITED BY SPACES
    '!'
  INTO RETURNED-MESSAGE.
  GOBACK.
